{
  "RELIANCE.NS": {
    "name": "Reliance Industries Limited",
    "sector": "Energy",
    "industry": "Oil & Gas Refining & Marketing",
    "description": "Reliance Industries Limited engages in the hydrocarbon exploration and production, oil and chemicals, retail, and digital service businesses worldwide. It operates through Oil to Chemicals, Oil and Gas, Retail, Digital Services, and Others segments. The company offers refining and marketing products, including liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosine oil, diesel, sulphur, and petroleum coke. It also provides polymers, including high-density and low-density polyethylene (PE), linear low-density PE, homopolymer, random and impact copolymer, and polyvinyl chloride; fibre intermediates, such as purified terephthalic acid, and ethylene glycols and oxide; aromatics, such as paraxylene, ortho xylene, benzene, and linear alkyl benzene and paraffin; and textiles comprising fabrics, apparel, and auto furnishings. In addition, the company offers elastomers, such as polybutadiene rubber, styrene butadiene rubber, and butyl rubber; fibre and yarn polyesters; and bioenergy solutions, consisting of compressed biogas, and pellets and briquettes. Further, it engages in oil and gas exploration and production activities; and operates various stores comprising supermarket, hypermarket, wholesale cash and carry, specialty, and online stores, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, consumer electronics, and others. Additionally, the company operates media and entertainment platforms, and Network18 and television channels; publishes magazines; and offers highway hospitality and fleet management services. It also provides digital services, including connectivity, fibre, mobile devices, apps, business, and other digital solutions. The company was founded in 1957 and is based in Mumbai, India."
  },
  "INFY.NS": {
    "name": "Infosys Limited",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "description": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and digital services in North America, Europe, India, and internationally. It provides digital marketing and digital workplace, digital commerce, digital experience and interactions, and metaverse; data analytics and AI, applied AI, generative AI, and sustainability; blockchain, engineering, and Internet of Things; enterprise agile DevOps, API economy and microservices, application modernization, cloud, digital process automation, digital supply chain, Microsoft business application and cloud business, service experience transformation, energy transition, Network Transformation Services, Infrastructure Services cyber security, and quality engineering solutions; Oracle, SAP, and Saleforce solutions; Topaz, an AI-first set of services, solutions, and platforms using generative AI technologies; and Aster, a set of AI-amplified marketing services, solutions, and platforms. The company also offers Finacle, a core banking solution; Edge suite of products; Panaya platform, Infosys Equinox, Infosys Live Enterprise Suite, Infosys Wingspan, Infosys Helix, Infosys Meridian, Infosys Polycloud, Infosys Cortex, and Stater digital platforms; and Infosys McCamish, an insurance platform. It serves aerospace and defense, agriculture, automotive, chemical manufacturing, communication, consumer packaged goods, education, engineering procurement and construction, financial, healthcare, high technology, industrial manufacturing, information services and publishing, insurance, life science, logistics and distribution, media, entertainment, mining, oil and gas, private equity, professional, public, retail, semiconductor, travel, hospitality, utilities, and waste management industries. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was incorporated in 1981 and is headquartered in Bengaluru, India."
  },
  "TCS.NS": {
    "name": "Tata Consultancy Services Limited",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "description": "Tata Consultancy Services Limited provides information technology (IT) and IT enabled services in the Americas, Europe, India, and internationally. The company provides TCS ADD, a suite of AI powered life sciences platforms; TCS BaNCS, a financial services platform; TCS BFSI Platforms, a cloud-native, as-a-service digital ecosystem for insurers and financial firms; TCS Chroma, a cloud-based human resource management system platform; TCS Customer Intelligence & Insights, an AI-driven customer analytics and real-time CDP solution; TCS ERP on Cloud, an SAP platform as a service; ignio, a cognitive automation software product; TCS iON, a learning ecosystem; and TCS HOBS, a cloud-native, catalog-centric platform for personalization of products and processes. It also offers TCS Intelligent Urban Exchange for enterprises and smart cities; TCS OmniStore, a retail commerce platform; TCS Optumera, a retail-connected strategic intelligence platform; TCS Tap, a platform for intelligent procurement; Quartz, a distributed ledger technology; TCS TwinX, an enterprise digital twin platform; TCS MasterCraft, an AI-driven cognitive automation product; Jile, an enterprise agile planning and delivery tool; and TCS DigiBOLT, an end-to-end, organization-wide enterprise platform. In addition, the company provides cloud, cognitive business, consulting, cybersecurity, data and analytics, enterprise solutions, IoT and digital engineering, TCS interactive, artificial intelligence, network solutions, and sustainability services. It serves banking; capital markets; consumer packaged goods and distribution; communications, media, and information services; education; energy, resources, and utilities; healthcare; high tech; insurance; life sciences; manufacturing; public services; retail; and travel and logistics industries. The company was founded in 1968 and is based in Mumbai, India. Tata Consultancy Services Limited is a subsidiary of Tata Sons Private Limited."
  },
  "HDFCBANK.NS": {
    "name": "HDFC Bank Limited",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "description": "HDFC Bank Limited provides banking and financial products and services to individuals and businesses in India, Bahrain, Hong Kong, Singapore, and Dubai. The company operates through Treasury, Retail Banking, Wholesale Banking, Other Banking Business, Insurance Business, and Other segments. It offers savings, salary, current, rural, public provident fund, pension, and demat accounts; fixed and recurring deposits; and safe deposit lockers, as well as offshore accounts and deposits, and overdrafts against fixed deposits. The company also provides personal, home, car, two-wheeler, business, doctor, educational, gold, consumer, and rural loans; loans against properties, securities, mutual funds, rental receivables, and assets; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, healthcare/medical equipment, commercial vehicle finance, dealer finance, and term loans. In addition, it offers credit, debit, prepaid, forex, and kisan gold cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, and merchant and cash management services; and insurance and investment products. Further, the company provides short term finance, bill discounting, structured finance, export credit, loan repayment, custodial, and documents collection services; online, mobile, and phone banking services; unified payment interface, immediate payment, national electronic funds transfer, and real time gross settlement services; channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services; and financial solutions for supply chain partners and agricultural customers. It operates branches and automated teller machines in various cities/towns. The company was incorporated in 1994 and is headquartered in Mumbai, India."
  },
  "ICICIBANK.NS": {
    "name": "ICICI Bank Limited",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "description": "ICICI Bank Limited, together with its subsidiaries, engages in the provision of various banking and financial services to retail and corporate customers in India and internationally. The company operates through Retail Banking, Wholesale Banking, Treasury, Other Banking, Life Insurance, General Insurance, and Others segments. It offers savings, salary, pension, current, trade, escrow, foreign currency, and vostro accounts, as well as time, fixed, recurring, and security deposits. The company also provides home, car, two-wheeler, personal, education, gold, and commercial business loans, as well as loans against securities, shares, mutual funds, and property; working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and overdraft facilities, as well as loans for new entities and card swipes; and credit, debit, prepaid, travel, forex, and corporate cards. In addition, it offers pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, initial public offerings, and other online investment services; and agri and rural business, farmer finance, tractor loans, and micro banking services. Further, the company provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, and institutional banking services; general, life health, personal accident, fire, travel, and motor insurance products; and internet, mobile, and phone banking services. Additionally, it offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, pension fund management, asset management, investment advisory, points of presence, and private equity/venture capital fund management services. The company was founded in 1955 and is headquartered in Mumbai, India."
  },
  "SBIN.NS": {
    "name": "State Bank of India",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "description": "State Bank of India provides banking products and services in India and internationally. It operates through the Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Business segments. The company offers personal banking products and services, including current, savings, salary, and deposit accounts; home, personal, pension, auto, education, and gold loans, as well as loans against insurance policies, property, and securities; debit, business debit, prepaid, and green remit cards; overdrafts; mutual funds, insurance, equity trading, portfolio investment schemes, remittance services; digital lending; and mobile, internet, and digital banking services. It also provides corporate banking products and services comprising corporate accounts, working capital and project finance, deferred payment guarantees, corporate term loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms' overseas subsidiaries or JVs, and cash management, as well as trade and service products. In addition, the company offers NRI services, including accounts, investments, loans, and remittances; agricultural banking services; and international banking services. Further, it provides life and general insurance; estate planning services; merchant banking and advisory; securities broking; trusteeship service; factoring; payment solution; asset management; portfolio and investment management; credit cards; and custody and fund accounting services. State Bank of India was founded in 1806 and is headquartered in Mumbai, India."
  },
  "AXISBANK.NS": {
    "name": "Axis Bank Limited",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "description": "Axis Bank Limited provides various financial products and services in India and internationally. The company operates through four segments: Treasury, Retail Banking, Corporate/Wholesale Banking, and Other Banking Business. It provides fixed, recurring, and safe deposits; and saving, salary, current, safe custody, pension disbursement, and demat and trading accounts. The company also offers home, personal, business, car, two-wheeler, commercial vehicle construction equipment, education, gold, trade, and supply chain loans, as well as loans against securities, fixed deposits, properties, and credit cards; and overdrafts. In addition, it provides credit and debit cards; mutual and debt funds; governmental investment products, such as public provident fund, floating rate saving bonds, and national pension system; digital gold and sovereign gold bonds; digital rupee; insurance services, such as life, general, and health insurance; and various forex products and services. Further, the company offers phone, digital, and mobile banking services, as well as ATM services. Additionally, it provides equity, derivative trading, central funding unit, financial and corporate advisory, NRI, para banking, placements and syndication, project appraisal, capital market, and cash management services. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is headquartered in Mumbai, India."
  },
  "KOTAKBANK.NS": {
    "name": "Kotak Mahindra Bank Limited",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "description": "Kotak Mahindra Bank Limited provides a range of banking and financial services to corporate and individual customers in India. It operates through Treasury, BMU, and Corporate Centre; Retail Banking; Corporate / Wholesale Banking; Digital Banking; Other Retail Banking; Vehicle Financing; Other Lending Activities; Broking; Advisory and Transactional Services; Asset Management; and Insurance segments. The company offers savings, current, and salary accounts; fixed, recurring, tax saving fixed, senior citizen, and fixed deposit products; home, personal, business, payday, gold, education, commercial vehicle, car, and crop loans, as well as loan against securities and properties; construction equipment, tractor and farm equipment, healthcare, trade and supply chain, and working capital finance solutions; and prepaid, credit, and debit cards. It also provides Investment products; life, term, health, car, and two wheeler insurance; payment services; trade services; business management and marketing, enterprise resource planning, supply chain and logistics, human resource, business travel, workspace management, taxation and legal, and healthcare/medical equipment services; cash management services, such as digital payments, physical collections, digital collections, and payment gateways; private banking services; net banking; and NRI services. In addition, the company offers term deposits, consumer finance, business banking, rural housing, FASTags, project finance, foreign exchange, custody services, debt capital markets; structured financing, discretionary, investment advisory solutions; estate planning, research services, margin trading facility, and index, overseas funds. Kotak Mahindra Bank Limited was incorporated in 1985 and is headquartered in Mumbai, India."
  },
  "ITC.NS": {
    "name": "ITC Limited",
    "sector": "Consumer Defensive",
    "industry": "Tobacco",
    "description": "ITC Limited engages in the fast-moving consumer goods, paperboards, paper and packaging, and agri businesses in India and internationally. The company offers cigarettes and cigars; foods, including staples, spices, biscuits, confectionery and gums, snacks, noodles and pasta, beverages, dairy products, ready-to-eat meals, chocolates, coffee, and frozen foods; personal care products; education and stationery, such as balls, gels and roller pens, mechanical pencils, geometry boxes, erasers, sharpeners and rulers, wax crayons, plastic crayons, and sketch pens and oil pastels; safety matches; and agarbattis and dhoops under various brands, as well as operates a hotel under the ITC Grand Central name in Mumbai. It also provides virgin, recycled, coated barrier, cupstock base, liner, liquid packaging, antifungal, solid, and graphic boards, as well as specialty papers; surfacing, print base, barrier, overlay, and liner papers; plastic substitution products; and packaging products, including cartons, flexible, tobacco, and green packaging products. In addition, the company exports feed ingredients, food grains, marine products, processed fruits, coffee products, leaf tobacco products, and spices; and offers information technology services for the banking and financial services, healthcare, manufacturing, consumer goods, travel, and hospitality industries, as well as produces and commercializes seed potato technology products. Further, it provides property infrastructure maintenance; engineering, procurement and construction management and project management consultancy services; business consulting; and agro-forestry and other related services, as well as engages in the fabrication and assembly of machinery for tube filling, cartoning, wrapping, and conveyor solutions and engineering activities. ITC Limited was incorporated in 1910 and is headquartered in Kolkata, India."
  },
  "LT.NS": {
    "name": "Larsen & Toubro Limited",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "description": "Larsen & Toubro Limited engages in engineering, procurement, and construction projects (EPC) in India and internationally. The Infrastructure Projects segment is involved in the engineering and construction of building and factories, transportation infrastructure, heavy civil infrastructure, power transmission and distribution, water and effluent treatment, and minerals and metals. The Energy Projects segment provides EPC solutions in oil & gas, refineries, petrochemicals & offshore wind energy sectors, from front-end design through detailed engineering, modular fabrication, procurement, project management, construction, installation and commissioning; CarbonLite solutions for power generation plants including power generation equipment with associated systems; and carbon capture utilization and utility packages. The Hi-Tech Manufacturing segment designs, manufactures/constructs, supplies, and revamps/retrofits custom designed engineered critical equipment and systems for the process plants, nuclear energy, and green hydrogen sectors; marine and land platforms, related equipment and systems, and aerospace products and systems; precision and electronics products and systems for defense, security, space, and industrial sectors; and electrolysers. The IT & Technology Services segment offers information technology and integrated engineering services, e-commerce/digital platforms and data centers, and semiconductor chip design solutions. The Financial Services segment provides retail finance. The Development Projects segment develops, operates, and maintains metro project comprising transit-oriented development, toll roads, power generation and development, thermal power, and green energy. The Others segment engages in realty, manufacture and sale of industrial valves; marketing and servicing of construction equipment, mining machinery and parts, and processing machinery. Larsen & Toubro Limited was founded in 1938 and is headquartered in Mumbai, India."
  },
  "BHARTIARTL.NS": {
    "name": "Bharti Airtel Limited",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "description": "Bharti Airtel Limited operates as a telecommunications company in India and internationally. It operates through the Mobile Services India, Mobile Services Africa, Mobile Services South Asia, Airtel Business, Passive Tower Infrastructure Services, Homes Services, Digital TV Services, and Others segments. The company provides voice and data telecom services through wireless technology including 2G/3G/4G/5G services; passive infrastructure service, including the setup, operation, and maintenance of wireless communication towers; home services covering voice and data communications through fixed-line network, wireless network, and broadband technology for homes; and digital TV services comprising digital broadcasting services under the DTH platform and IPTV services. It also engages in the airtel business that includes network integration, managed services, CPaaS, PaaS, cloud, cybersecurity, IoT, and data center services, as well as enterprise mobility applications. In addition, the company offers post-paid, prepaid, roaming, internet, and various value-added services, as well as mobile TV, video calls, live-streaming videos, gaming, video streaming, and other services. The company was formerly known as Bharti Tele-Ventures Limited and changed its name to Bharti Airtel Limited in April 2006. Bharti Airtel Limited was incorporated in 1995 and is headquartered in New Delhi, India."
  },
  "ASIANPAINT.NS": {
    "name": "Asian Paints Limited",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "description": "Asian Paints Limited, together with its subsidiaries, engages in the manufacture, distribution, and sale of paints, coatings, and products related to home decoration and bath fittings in India, Asia, the Middle East, Africa, and the South Pacific region. The company offers wall coverings; waterproofing products; adhesives; and bath fittings and sanitaryware, modular kitchens and wardrobes, fabric, furnishings and rugs, decorative lightings, unplasticized polyvinyl chloride windows and door systems, textures and painting aids, and mechanized tools, as well as personalized interior design, homes painting, color consultancy projects, and homes services; and wood solutions. It also provides interior and exterior wall finishes, enamels, tools, undercoats, thinners, and varnishers. The company offers its products under the Asian Paints, SCIB Paints, Apco Coatings, Asian Paints Berger, Taubmans, Asian Paints Causeway, and Kadisco Asian Paints brand names through a network of dealers and retail stores, as well as operates asianpaints.com, an online shop. Asian Paints Limited was founded in 1942 and is headquartered in Mumbai, India."
  },
  "BAJFINANCE.NS": {
    "name": "Bajaj Finance Limited",
    "sector": "Financial Services",
    "industry": "Credit Services",
    "description": "Bajaj Finance Limited operates as a deposit-taking non-banking financial company in India. The company offers financing for various products, such as consumer electronics, furniture, digital products, e-commerce purchases, retail spends, and two and three-wheelers; and personal, unsecured, home, and secured, gold, and car loans. It also provides secured and unsecured loans to micro, small, and medium enterprises (MSMEs), SMEs, and professionals; loans against property, mutual funds, insurance policies, and shares; developer finance and lease rental discounting services; and new and used car financing, and tractor financing. In addition, the company also offers commercial and rural lending; public and corporate deposits; loans against securities; micro-finance and auto financing lending; and broking and margin trade financing services. Further, it distributes life, health, and general insurance products. The company was formerly known as Bajaj Auto Finance Limited and changed its name to Bajaj Finance Limited in September 2010. The company was incorporated in 1987 and is based in Pune, India. Bajaj Finance Limited is a subsidiary of Bajaj Finserv Ltd."
  },
  "MARUTI.NS": {
    "name": "Maruti Suzuki India Limited",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "description": "Maruti Suzuki India Limited manufactures, purchases, and sells motor vehicles, components, and spare parts in India. The company offers passenger vehicles, utility vehicles, and multi-purpose vehicles. It is also involved in the facilitation of pre-owned car sales, fleet management, and car financing activities. In addition, the company offers driving school, insurance, accessories, and financing products and services. It also exports its products to South Africa, Saudi Arabia, Chile, Japan, Mexico, and internationally. The company was formerly known as Maruti Udyog Limited and changed its name to Maruti Suzuki India Limited in September 2007. Maruti Suzuki India Limited was incorporated in 1981 and is headquartered in New Delhi, India. Maruti Suzuki India Limited is a subsidiary of Suzuki Motor Corporation."
  },
  "HCLTECH.NS": {
    "name": "HCL Technologies Limited",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "description": "HCL Technologies Limited provides IT and business services, engineering and research and development services, and modernized software products and IP-led offerings. It operates through IT and Business Services; Engineering and R&D Services; and HCL Software segments. The company provides application development, management, modernization, and testing, as well as commercial applications; automation services, including digital integration, business process management, robotic process automation for intelligent automation, and low and no code services; digital process operations, such as customer experience management, hyper intelligent automation, supply chain management, finance and accounting, marketing operations and content, and human resource services; and data and AI services consisting of strategy and advisory, modernize data, simplify insights, and scale AI. It also offers commercial applications for sales, accounting, finance, HR, inventory, and manufacturing operations; cybersecurity services; systems engineering, simulation process and data management, manufacturing engineering, supplier collaboration, and digital thread and twin, as well as application, service, and product lifecycle management; and HCLTech Career Shaper, a learning and assessment platform. In addition, the company provides cloud engineering, digital platform engineering, digital commerce and manufacturing, silicon platform solutions, 5G engineering, SemiCloud, and AITech services; and IT enablement and service desk, unified communication and collaboration, workplace assessment and automation, mobility services, and cloud office. Further, it offers intelligent operations, internet of things, marketing services, operational technology, product engineering, supply chain, and unified service management, as well as enterprise network solutions. The company was founded in 1976 and is headquartered in Noida, India."
  },
  "WIPRO.NS": {
    "name": "Wipro Limited",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "description": "Wipro Limited operates as an information technology (IT), consulting, and business process services company worldwide. It operates through IT Services and IT Products segments. The IT Services segment offers AI-powered IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology and IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, cloud and infrastructure, business process, cloud, mobility and analytics, research and development, and hardware and software design services to enterprises. It serves customers in various industry sectors, such as communications, media and information services, software and gaming, new age technology, consumer goods, healthcare, medical devices and life sciences, and technology products and services, as well as banking and financial services, energy, manufacturing and resources, capital markets and insurance, and hi-tech. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The company was incorporated in 1945 and is based in Bengaluru, India."
  },
  "ULTRACEMCO.NS": {
    "name": "UltraTech Cement Limited",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "description": "UltraTech Cement Limited, together with its subsidiaries, engages in the manufacture and sale of clinker, cement, ready mix concrete, and related products in India, the United Arab Emirates, Bahrain, and Sri Lanka. The company offers ordinary Portland, Portland pozzolana, composite, Weather Plus, and Portland slag; white cement, wall care putty, and value-added products; ready-mix concrete; dry mix mortars, such as tile and marble binders, plasters and mortars, industrial and precision grouts, repair and rehabilitation, and flooring screed; and waterproofing products, including liquid and cement waterproofing products. It also provides masonry products; and TMT steel bars, paints, waterproofing solutions and treatments, switchboards and fittings, plywood, shuttering ply, power and hand tools, PVC pipes, sanitary ware, roofing sheets, and water storage tanks, as well as flooring materials, such as marble, granite, and semi-precious stones through its retail stores under UltraTech Home Expert Store brand name. In addition, the company operates mobile concrete labs that offers on-ground technical assessment of construction materials; and provides Vaastu, pest control, and water testing services, as well as home loans. It offers its products under UltraTech Décor, DuraFacad, Pervious, MaxSheen, AquaSeal, ThermoCon+, FreeFlow+, FireSafe, DuraPlus, CorroProtect, Litecon, iFloors, Rapid, and ZIP brands. The company was incorporated in 2000 and is based in Mumbai, India. UltraTech Cement Limited operates as a subsidiary of Grasim Industries Limited."
  },
  "ADANIENT.NS": {
    "name": "Adani Enterprises Limited",
    "sector": "Energy",
    "industry": "Thermal Coal",
    "description": "Adani Enterprises Limited, together with its subsidiaries, operates in the new energy ecosystem, data center, airports, roads, copper, digital space, and other sectors in India and internationally. It operates through the Integrated Resources Management (IRM), Mining Services, Commercial Mining, New Energy Ecosystem, Airport, Road, and Others segments. The company engages in the integrated ecosystem for manufacturing green hydrogen, including solar cells, modules, and wind manufacturing; construction, operation, and maintenance of airports and road assets; commercial mining activities; supply of bunker to fuels to shipping vessels; manufacture and supply of defense equipment; and copper smelting and refinery, as well metals manufacturing. It also provides airport-focused services, including duty-free shopping, food and beverages, car parking, meet-and-greet, flight tracking, and airport maps services; and procurement and logistics services for minerals, as well as mining services. In addition, the company is involved in the sourcing, storage, and marketing of apples, grapes, pomegranates, and frozen peas; wastewater treatment, recycling, and reuse projects; a operation of a news network. Further, it holds a portfolio of small arms, ammunition, unmanned aerial vehicles, counter-drone systems, missiles, and aircraft services. The company was founded in 1988 and is headquartered in Ahmedabad, India. Adani Enterprises Limited operates as a subsidiary of S.B. Adani Family Trust."
  },
  "ADANIPORTS.NS": {
    "name": "Adani Ports and Special Economic Zone Limited",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "description": "Adani Ports and Special Economic Zone Limited, together with its subsidiaries, develops, operates, and maintains port infrastructure in India. The company is involved in the operation of ports and terminals, including bulk and break bulk, container, liquid, LPG, LNG, and crude cargo; ports related infrastructure development activities; and development of infrastructure at contiguous Special Economic Zone at Mundra. It also offers logistic services, which include logistic parks, container rail and bulk cargo logistic solutions, and warehousing, as well as auto, road, and agriculture logistic services. In addition, the company operates a fleet of dredging and reclamation service equipment comprising cutter suction, trailing suction hopper, grab, inland cutter suction, water injection, and specialized dredgers; split hopper, flat top, and jack up barges; and multi utility craft, survey vessels, floating crane, drag flow unit, and floating booster, as well as dozers, excavotors, loaders, and other equipment. Further, it provides non-scheduled passenger airline services; hospital and related services; and marine services, such as pilotage, laying, mooring of vessels at berth and mid-stream, and maintenance of buoys. Additionally, the company engages in the development, construction, operation, and maintenance of railway corridors; land development activities; integrated textile park and container freight station businesses; owns and operates harbour tugs, barges, other port crafts, ocean towage and offshore support vessels; and provision of cargo storage-cum logistics services. The company was incorporated in 1998 and is headquartered in Ahmedabad, India."
  },
  "TITAN.NS": {
    "name": "Titan Company Limited",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "description": "Titan Company Limited, together with its subsidiaries, manufactures and sells watches, jewelry, eyewear, and other accessories and products in India and internationally. It operates through four segments: Watches and Wearables, Jewellery, Eyecare, and Others. The company designs, manufactures, and retails watches and wearables under the Nebula, Titan, Titan Clocks, Zoop, Titan Octane, Raga, Xylys, Edge, Fastrack, Sonata, Titan Smart, Fastrack smart, SF, Titan World, and Helios brands; jewellery products under the Mia, CaratLane, Tanishq, and Zoya brands; and eyecare products under the Titan Glares, Titan Eye+ and Fastrack Eyecare brands. It also offers sarees, dress materials, and ready-to-wear kurtas under the Taneira brand; perfumes under the SKINN brand; belts and wallets under the TITAN brand; and bags under the Fastrack and IRTH brands. In addition, the company provides manufacturing services and automation solutions for aerospace, defense, transportation, electrical and electronics, and medical sectors. It offers its products through owned and franchised retail stores, as well as online. The company was formerly known as Titan Industries Limited and changed its name to Titan Company Limited in August 2013. Titan Company Limited was incorporated in 1984 and is based in Bengaluru, India."
  },
  "SUNPHARMA.NS": {
    "name": "Sun Pharmaceutical Industries Limited",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "description": "Sun Pharmaceutical Industries Limited, a generic pharmaceutical company, develops, manufactures, and markets branded and generic formulations, and active pharmaceutical ingredients (APIs) in India, the United States, and internationally. The company offers formulations in various therapeutic areas, including neuropsychiatry, cardiology, diabetes, gastroenterology, pain/analgesics, gynecology, ophthalmology, urology, dermatology, respiratory, anti-infectives, oncology, psychiatry, neurology, orthopaedic, nephrology, urology, dermatology, respiratory, dental, and nutritionals. It also provides generic medications, such as tablets, capsules, injectables, inhalers, ointments, creams, and liquids; speciality medications; antiretrovirals medications; and over-the-counter products, such as vitamins, analgesics, digestives, and lifestyle. In addition, the company offers APIs for anti-cancers, peptides, steroids, sex hormones, immunosuppressant drugs, and controlled substances. It exports its products to approximately 90 countries across Asia, North America, Europe, Africa, South America, and Australia. Sun Pharmaceutical Industries Limited was founded in 1983 and is headquartered in Mumbai, India."
  },
  "NTPC.NS": {
    "name": "NTPC Limited",
    "sector": "Utilities",
    "industry": "Utilities - Regulated Electric",
    "description": "NTPC Limited operates as an integrated power company in India. It operates through two segments: Generation and Others. The company generates power from fossil fuels, hydro, solar, wind, nuclear, and renewable energy sources. It also engages in the coal mining and energy trading business. NTPC Limited was incorporated in 1975 and is based in New Delhi, India."
  },
  "POWERGRID.NS": {
    "name": "Power Grid Corporation of India Limited",
    "sector": "Utilities",
    "industry": "Utilities - Regulated Electric",
    "description": "Power Grid Corporation of India Limited, an electric power transmission utility, engages in the power transmission business in India and internationally. It operates in three segments: Transmission Services, Telecom Services, and Consultancy Services. As of 31 March 2025, the company owned and operated 180,195 circuit kilometers of transmission lines, and 282 substations with an aggregate transformation capacity of 551,961 mega volt amperes. It also provides telecom services that offer overhead optic fiber network services using optical ground wire on power transmission lines under the POWERTEL brand name, as well as lease lines, MPLS-VPN, data, infrastructure, and international long-distance services. In addition, it provides consultancy services to the transmission, distribution, and telecom sectors on system planning and feasibility studies; environmental and social studies; design and engineering; contract/procurement services; project management and construction supervision; capacity building; operation and maintenance; asset management; owners' and lenders' engineer services to utilities and funding institutions; preparation of grid code, tariff mechanisms, and market analysis; legal and technical advisory in power transmission; power system studies/DPR preparation; smart grid and EV charging; load despatch and communication; sub-transmission/distribution/rural electrification services; testing and quality assurance and inspection; energy efficiency; and preventive vigilance, as well as human resource development. Further, it operates electric vehicle charging stations; and engages in solar power generation, green hydrogen production, smart metering, and data centers. The company was formerly known as National Power Transmission Corporation Limited and changed its name to Power Grid Corporation of India Limited in October 1992. Power Grid Corporation of India Limited was incorporated in 1989 and is based in Gurugram, India."
  },
  "BAJAJFINSV.NS": {
    "name": "Bajaj Finserv Ltd.",
    "sector": "Financial Services",
    "industry": "Financial Conglomerates",
    "description": "Bajaj Finserv Ltd., through its subsidiaries, provides financial services in India. The company operates through Life Insurance, General Insurance, Windmill, Retail Financing, and Investments and Others segments. It offers personal, business, home, home renovation, commercial, car, and gold loans; two- and three-wheeler loans; mortgages; education loans; unsecured and secured loans to small and medium-sized enterprises and professionals, as well as micro, small and medium enterprises; loans against properties, securities, car, mutual funds, bonds, and insurance policy; financing for products, such as consumer electronics, digital, lifecare, furniture, etc.; developer financing; and lease rental discounting products. The company also provides investment products, including fixed deposits, systematic deposit plans, and mutual funds; savings products; life, health, motor, fire, engineering, liabilities, marine, crop, car, two-wheeler, pet, home, travel, and personal accident insurance products; wealth management and retirement planning services; healthcare services comprising wellness, outpatient, and inpatient services; and wallets and credit cards. In addition, it offers pocket subscription plans; bill and recharge services; digital technology services; and trading and demat account, stock broking, margin trading, and HNI and retail broking services, as well as gold loans. Further, the company owns and operates 138 windmills with total installed capacity of 65.2 megawatts. Bajaj Finserv Ltd. was incorporated in 2007 and is based in Pune, India."
  },
  "ONGC.NS": {
    "name": "Oil and Natural Gas Corporation Limited",
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "description": "Oil and Natural Gas Corporation Limited, together with its subsidiaries, engages in the exploration, development, production, and distribution of crude oil, natural gas, and value-added products in India and internationally. It operates through Exploration and Production, Refining & Marketing, and Petrochemicals segments. The company engages in the refining and marketing of petroleum products; liquefied natural gas supply; pipelines for transportation of petroleum products; SEZ development; helicopter services; and production of ethanol, sugar, petrochemicals, liquefied petroleum gas, naphtha, ethane, propane, butane, kerosene oil, low sulphur heavy stock, residual crude oil, mineral turpentine oil, aviation turbine fuel, and high speed diesel. It also generates wind power through a total installed capacity of 153.9 MW; and solar power through a total installed capacity of 39.96 MW. The company also exports its products. Oil and Natural Gas Corporation Limited was founded in 1955 and is based in New Delhi, India."
  },
  "COALINDIA.NS": {
    "name": "Coal India Limited",
    "sector": "Energy",
    "industry": "Thermal Coal",
    "description": "Coal India Limited, together with its subsidiaries, produces and sells coal and coal products in India. The company offers coking coal for steel making and metallurgical industries, as well as for hard coke manufacturing; semi coking coal for blend-able coal in steel making, merchant coke manufacturing, and other metallurgical industries; and non-coking coal for thermal grade coal for cement, fertilizer, glass, ceramic, paper, chemical, and brick manufacturing, as well as power generation and other heating purposes. It also provides washed and beneficiated coal for manufacturing of hard coke for steel making and power generation, as well as for cement, sponge iron, and other industrial plants; middling products for power generation, domestic fuel plants, brick manufacturing units, cement plants, and industrial plants, etc.; and rejects products for fluidized bed combustion boilers for power generation, road repairs, briquette making, and land filling, etc. In addition, the company offers CIL/LTC coke for use in furnaces and kilns of industrial units, as well as domestic fuel by halwais, and hotels, etc.; coal/coke fines for use in industrial furnaces and domestic purposes; and tar, heavy and light oil, and soft pitch for use in furnaces and boilers of industrial plants, power houses, oil, dye, and pharmaceutical industries, etc. Further, it engages in coal mining and gasification; consultancy support in coal and mineral exploration; and renewable and solar energy. The company was formerly known as Coal Mines Authority Limited and changed its name to Coal India Limited in January 1975. Coal India Limited was incorporated in 1973 and is headquartered in Kolkata, India."
  },
  "TECHM.NS": {
    "name": "Tech Mahindra Limited",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "description": "Tech Mahindra Limited provides information technology services and solutions in the Americas, Europe, India, and internationally. The company operates through Information technology (IT) Business and Business Process Services (BPS) segments. It offers Application Development Maintenance, intelligent automation, testing, and performance engineering; cloud consulting; engineering and network services; data analytics; and artificial intelligence services. The company also provides business process services, including Consulting NXT.NOW, growth accelerators, business-process-as-a-service; and service desk, technical assistance center, supply chain management, finance and accounting, GIS, analytics, trust and safety, customer experience, and transformation through technology; customer experience and design services; and cyber security, blockchain, and metaverse. In addition, it offers ESG consulting, energy, resource management, ESG talent pool, supply chain, data management and reporting, and environment, health, and safety; and digital enterprise applications. Further, the company provides Yantr.ai, a field service management software; Kornea, a cloud-native AI-powered workforce management solution; Populii, and enterprise gig platform; AceFin, an AI-based BPaaS solution; AftEAZE, a digital aftermarket platform; netOps.ai, a cloud platform for telco networks; MobiLytix marketing studio; Epselon automation platform; Entellio, a chatbot platform; Blue Marble solution; and InfoWise for enterprise metadata. It serves banking and financial services; communication; energy and utilities; healthcare and life sciences; hi-tech; insurance; manufacturing; media and entertainment; private equity; oil and gas; professional service; retail and consumer goods; and travel, transportation, hospitality, and logistic sectors. The company was incorporated in 1986 and is based in Pune, India."
  },
  "INDUSINDBK.NS": {
    "name": "IndusInd Bank Limited",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "description": "IndusInd Bank Limited provides various banking products and financial services to individuals, corporations, government entities, and public sector undertakings in India. It operates in four segments: Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. The company offers savings, salary, RFC, and uniformed personnel accounts; current accounts comprising smart, everyday, premium, trade, startup, and specialized accounts; fixed, recurring, sweep in/out, senior citizen fixed, NRE and NRO fixed, FCNR, and term deposits; vehicle, used and new car, two wheeler, home, gold, agri, personal, doctor professional, medical equipment, term, quick business, SME, and MSME loans; loans against property and securities; loans on credit card; and microfinance, working capital, and trade and export finance. It also provides debit, credit, prepaid, commercial, forex, duo, corporate, and business cards; life, health, and general insurance; safe deposit lockers; payment and financial inclusion products; foreign exchange services, including inward and outward remittances, and online forex portals; digital banking; and online vehicle auction services. In addition, the company offers mutual funds; bill payment; money transfer; NRI services; merchant solutions comprising POS terminal, payment gateway, digital rupee, and QR; transaction banking services, including trade finance, cash management, and tax payment; supply chain finance solutions, including supplier/vendor finance, channel finance, and receivable finance/factoring solutions; investment banking services consisting of debt syndication, debt and private equity fund-raising advisory, and M&A advisory; foreign exchange advisory; derivatives, such as currency, interest rate, and exchange-traded derivatives; debt capital markets, bullions, research, and online platforms; and correspondent and inclusive banking. IndusInd Bank Limited was incorporated in 1994 and is headquartered in Mumbai, India."
  },
  "GRASIM.NS": {
    "name": "Grasim Industries Limited",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "description": "Grasim Industries Limited, together with its subsidiaries, primarily produces cellulosic fibres, diversified chemicals, fashion yarns, and fabrics in india and internationally. The company operates through Cellulosic Fibres, Chemicals, Building Materials, Financial Services, and Others segments. It offers cellulosic staple fibre; and cellulosic fashion yarn; chlor-alkali comprising caustic soda; chlorine derivatives, and specialty chemicals, that include epoxy polymers and curing agents. The company also provides grey cement, white cement-based putty, and ready-mix concrete; and decorative paints comprising interior and exterior water- based paints, enamel paints, wood finishes, waterproofing solutions, and wallpapers under the Birla Opus brand name. In addition, it operates Birla Pivot, a business-to-business e-commerce platform for building and construction materials; and offers non-banking financial services, housing finance, asset management, and health and life insurance, protection, investments, advisory, and value-added services. Further, the company provides textile products, such as linen fabrics, wool tops and worsted yarn, and cotton fabrics under Linen Club, Cavallo, Soktas, and Giza House brands; manufactures and sells ceramic and composite insulators for transmission and distribution lines, sub-stations, power equipment, and railway electrification industries; and engages in generating clean energy using solar, wind, hybrid, and floating solar systems. The company was incorporated in 1947 and is based in Mumbai, India."
  },
  "GOKEX.NS": {
    "name": "Gokaldas Exports Limited",
    "sector": "Consumer Cyclical",
    "industry": "Apparel Manufacturing",
    "description": "Gokaldas Exports Limited designs, manufactures, and sells a range of garments in India. The company offers fashion wear, outerwear, bottom wear, casualwear, and sportswear, such as jackets, pants, tops/shirts, and other products for men, women, and children. It serves international fashion brands and retailers. The company also exports its products to approximately 50 countries worldwide. Gokaldas Exports Limited was incorporated in 1979 and is based in Bengaluru, India."
  },
  "PARADEEP.NS": {
    "name": "Paradeep Phosphates Limited",
    "sector": "Basic Materials",
    "industry": "Agricultural Inputs",
    "description": "Paradeep Phosphates Limited manufactures, trades, distributes, and sells urea and complex fertilizers in India. It offers di-ammonium phosphate; nitrogen, phosphorus, potassium fertilizers; muriate of potash; triple super phosphate; zypmite; phospho-gypsum; sulphuric acid; hydrofluorosilicic acid; and ammonia; as well as sulphur and zinc. It sells its products through dealers and retailers under the Navratna and Jai Kisaan brand names. The company was incorporated in 1981 and is based in Bengaluru, India. Paradeep Phosphates Limited is a subsidiary of Zuari Maroc Phosphates Private Limited."
  },
  "RRKABEL.NS": {
    "name": "R R Kabel Limited",
    "sector": "Industrials",
    "industry": "Electrical Equipment & Parts",
    "description": "R R Kabel Limited manufactures and sells wires and cables, and fast-moving electrical goods in India and internationally. The company offers house wires, industrial wires, low and medium voltage power cables, and special cables. It also provides low smoke zero halogen, heat resistant and flame retardant, and halogen free panel wires; fire survival, LAN and Co-X, submersible and elevator flat, home automation, airfield lighting, HT and LT power, halogen free multi and single core, steel braided, instrumentation, HV and EHV power, braided, control, DC and floating solar, halogen free, data and communication, aluminium flexible, copper flexible, battery, BMS, MODBUS, PROcess field bus, servo and drag chain, flexible single and multicore core, trirated, and auto cables; and braided straps. In addition, the company offers ceiling, table pedestal and wall, exhaust, and industrial fans; panel and down light, bulbs, and streetlights; MCB, DB, and modular switches; and water and room heaters, irons, and coolers, as well as switchgears and other appliances under the RR Signature brand name. Its products are used in residential, commercial, industrial, and infrastructure sectors. The company was formerly known as Ram Ratna Agro-Plast Limited and changed its name to R R Kabel Limited in November 2000. R R Kabel Limited was incorporated in 1995 and is based in Mumbai, India."
  },
  "GMDCLTD.NS": {
    "name": "Gujarat Mineral Development Corporation Limited",
    "sector": "Energy",
    "industry": "Thermal Coal",
    "description": "Gujarat Mineral Development Corporation Limited engages in mining and mineral processing business in India. The company operates through two segments, Mining and Power. It explores for lignite, bauxite, fluorspar, manganese, silica sand, limestone, bentonite, and ball clay. The company's products used in the textiles, chemicals, ceramics, bricks and captive power. Its products are also used in the electricity and synthetic natural gas generation, agriculture, mining and refining, transportation, hydrofluoric acid, refrigerant gas, flux in metallurgical, tableware, quick and hydrated lime, limestone tile and slab, wall cladding, vanity top, and synthetic foundry moulding catalyst sectors. The company also generates power using thermal, wind, and solar resources. Gujarat Mineral Development Corporation Limited was incorporated in 1963 and is based in Ahmedabad, India."
  },
  "FORCEMOT.NS": {
    "name": "Force Motors Limited",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "description": "Force Motors Limited, an integrated automobile company, designs, develops, manufactures, and sells a range of automotive components, aggregates, and vehicles in India. The company provides passenger vehicles, ambulances, school buses, and delivery van; small commercial, light commercial, multi utility vehicles, special vehicles, and spare parts; special utility vehicles, which include off-roaders/recreation vehicles and military vehicles; and agricultural tractors. Its product portfolio consists of urbania, a ground-up modular monocoque van platform for shared urban mobility; traveller, a platform that caters to passenger transport, cargo delivery, ambulances, and school buses; monobus; trax, a rugged utility vehicle platform for rural and last mile transport; special application vehicles; gurkha off-road vehicle; and electric vehicles. In addition, the company offers shared mobility solutions, commercial fleets, specialized transport, and defense solutions. It exports its products to various countries in the Middle East, Asia, Latin America, and Africa. The company was incorporated in 1958 and is based in Pune, India. Force Motors Limited operates as a subsidiary of Jaya Hind Industries Pvt. Ltd."
  },
  "SHAKTIPUMP.NS": {
    "name": "Shakti Pumps (India) Limited",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "description": "Shakti Pumps (India) Limited, together with its subsidiaries, engages in the manufacture, trade, and sale of pumps, motors, and their spare parts under the Shakti brand name in India and internationally. Its products include submersible, solar, vertical multistage centrifugal, monoblock end suction, pressure booster, wastewater, open well, shallow well and slow speed, immersible, solar open well, single shaft vertical multistage, plug and play, vertical multistage, mechanical seal, horizontal openwell, sewage, self-priming, and rapid suction pumps, as well as submersible, surface, and slip start synchronous motors. The company also provides positive displacement submersible, inverter submersible, micro surface, and firefighting pumpsets, as well as hydropneumatic booster system; and solar pump and hybrid controllers, solar and universal drives, starters, hybrid and grid tie inverters, RMS/IoT dongles, DU/DT filters, electronic and control plants, mechanical seals, and solar structures. In addition, the company engages in the manufacture and sale of EV motors, controllers, chargers, and variable frequency drives for two- and three-wheeler vehicles. The company's products are used for agriculture, irrigation, waste and sewage water treatments, firefighting, building services, oil and gas, power, metals, mining, and other industrial applications. It also exports its products. Shakti Pumps (India) Limited was incorporated in 1982 and is headquartered in Pithampur, India."
  },
  "CDSL.NS": {
    "name": "Central Depository Services (India) Limited",
    "sector": "Financial Services",
    "industry": "Capital Markets",
    "description": "Central Depository Services (India) Limited, together with its subsidiaries, provides depository services in India. It operates through Depository; Data Entry and Storage; and Repository segments. The Depository segment offers various services to investors, such as dematerialisation, rematerialisation, holding, transfer, and pledge of securities in electronic form; and e-voting services to companies. Its Data Entry and Stroage segment provides centralized record keeping of KYC document of capital market investors. The Repository segment offers policyholders/warehouse receipt holders a facility to keep insurance policies/warehouse receipts in electronic form and to undertake changes, modifications, and revisions in the policy/receipt. It also provides account opening, processing delivery and receipt instructions, pledging, nomination, transmission of securities, change in address, bank account details, and SMS services for depository participants (DPs). In addition, the company offers various services, such as electronic access to security information, electronic access to security information and execution of secured transaction, SMS alerts related to transactions, electronic consolidated account statements, and virtual annual general meetings; Myeasi mobile application; application programming interfaces for DPs, electronic delivery instruction slip, and electronic margin pledge; and electronic foreign investment monitoring, electronic system driven disclosure services, and electronic notices, as well as e-locker services. Further, it provides KYC registration agency, eKYC, electronic signature service, tax filing, stamp duty calendar, electronic negotiable warehouse receipts and electronic non-negotiable warehouse receipts, and electronic insurance account. The company serves market participants, exchanges, clearing corporations, DPs, issuers, and investors. Central Depository Services (India) Limited was incorporated in 1997 and is based in Mumbai, India."
  },
  "NATIONALUM.NS": {
    "name": "National Aluminium Company Limited",
    "sector": "Basic Materials",
    "industry": "Aluminum",
    "description": "National Aluminium Company Limited engages in the manufacture and sale of alumina and aluminum products in India and internationally. The company operates through Chemical and Aluminum segments. It offers aluminum metal products, such as ingots, alloy ingots, T-ingots, sows, billets, and wire rods; alumina and hydrate products, including calcined alumina and alumina hydrate; zeolite-A products; specialty alumina and hydrate products; and aluminum rolled and aluminum chequered sheets products. The company also owns and operates Coal Mine covering an area of 824.316 hectors situated in Chhendipada Tehsil of Angul District; an opencast mine covering an area of 16 square kilometers on Panchpatmali hills of Koraput district in Odisha; a wind power plant with 50.4 MW of generation capacity in Gandikota, Andhra Pradesh; a wind power plant with 47.6 MW of generation capacity at Jaisalmer, Rajasthan; a wind power plant with 50 MW of generation capacity at Devikot, Rajasthan; a wind power plant with 50.4 MW of generation capacity at Sangli, Maharashtra; and a solar power plant in Bhubaneswar, as well as alumina refinery and aluminum smelter plants and captive power plant. In addition, it owns and operates mechanized storage and ship handling facilities for exporting alumina and importing caustic soda. National Aluminium Company Limited was incorporated in 1981 and is based in Bhubaneswar, India."
  },
  "UNITDSPR.NS": {
    "name": "UNITDSPR",
    "sector": "Consumer Defensive",
    "industry": "Beverages - Wineries & Distilleries",
    "description": "United Spirits Limited, together with its subsidiaries, manufactures, sells, and distributes alcoholic beverages and other allied spirits in India and internationally. It operates through Beverage Alcohol and Sports segments. The company offers alcoholic beverages, such as Scotch whisky, Indian made foreign liquor whisky, malts, tequila, brandy, rum, vodka, and gin under the Godawan, McDowell's No.1, Royal Challenge, Royal Challenge American Pride, Signature, Antiquity, Black Dog, Director's Special Black, McDowell's Rum, McDowell's Brandy, and McDowell's X-series brands. It also imports, manufactures, distributes, and sells alcoholic beverages under Diageo's iconic brands, which include Don Julio, Singleton, Tanquery, Captain Morgan, Johnnie Walker, J&B, Baileys, Lagavulin, Talisker, VAT 69, Black & White, Smirnoff, and Ciroc. In addition, the company holds the perpetual right to the Royal Challengers Bengaluru cricket franchise of Indian Premier League and Women's Premier League. It also exports its products to approximately 24 countries. The company was formerly known as McDowell & Company Limited and changed its name to United Spirits Limited in October 2006. The company was founded in 1826 and is headquartered in Bengaluru, India. United Spirits Limited is a subsidiary of Relay B.V."
  },
  "BGRENERGY.NS": {
    "name": "BGR Energy Systems Limited",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "description": "BGR Energy Systems Limited, together with its subsidiaries, manufactures and sells capital equipment for power plants, petrochemical and process industries, and refineries in India and internationally. The company is involved in the provision of turnkey engineering, procurement, and construction services for power plants; and supply of sub and super critical steam turbines and generators, and single and multiple pressure level natural circulation heat recovery steam generators; and providing process coolers, finned tubes, radiator and compressors coolers, and tube bundles. It also offers turnkey solutions for EHV substations; optical fiber composite ground wire and optical line termination equipment; gas insulated switchgear substations; EHV transmission lines; plant electrical projects; and rural electrification, as well as power trading and balance of plant works for hydro projects. In addition, the company provides process equipment packages and systems, including phase separator system / skids, indirect water bath heater, gas conditioning, regulating and metering systems, knockout drums / scrubbers, and filter separators / dry gas filters; pipeline equipment; compressor packaging products; and storage tanks; deaerators, membrane based water treatment plant, membrane based desalination plants, effluent treatment and recycling plants, and condensate polishing units. In addition, it operates thermal power projects at Andhra Pradesh, Maharashtra, Tamil Nadu, Uttar Pradesh, and Chhattishgarh. BGR Energy Systems Limited was incorporated in 1985 and is based in Chennai, India."
  },
  "CLEAN.NS": {
    "name": "Clean Science and Technology Limited",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "description": "Clean Science and Technology Limited, together with its subsidiaries, manufactures fine and specialty chemicals in India, China, the Americas, Europe, and internationally. It operates through Performance Chemicals, FMCG Chemicals, and Pharmaceutical & Agro Intermediates segments. The company offers performance chemicals, including monomethyl ether of hydroquinone, butylated hydroxy anisole, tertiary butyl hydroquinone, hindered amine light stabilisers, and butylated hydroxytoluene, as well as clean antiOX 962, 4-oxo tempo, 4-butoxy tempo, clean light stab 770, 4-hydroxy tempo, l-ascorbyl palmitate, 2,5-di-tertiary butyl hydroquinone, and dimethyl sebacate. It also provides FMCG chemicals, such as 4-methoxy acetophenone, anisole, guaiacol, butylated hydroxy anisole, l-ascorbyl palmitate, tertiary butyl hydroquinone, para di-methoxy benzene, and ortho methoxy toluene. In addition, the company offers pharmaceutical and agro intermediates, which include guaiacol, dicyclohexyl carbodiimide, veratrole, DHDT, para benzoquinone, para di-methoxy benzene, anisole, and ortho methoxy toluene. It exports its products and serves polymers, coatings, food, automotive, construction, cosmetics, personal care, fragrances, pharmaceuticals, agrochemical manufacturers, specialty chemical firms, and other industries. The company was incorporated in 2003 and is headquartered in Pune, India."
  },
  "ACUTAAS.NS": {
    "name": "Acutaas Chemicals Limited",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "description": "Acutaas Chemicals Limited engages in the research and development, manufacture, and sale of pharmaceutical intermediates in India and internationally. The company offers pharma intermediates for use in regulated and generic active pharmaceutical ingredients for anti-retroviral, anti-inflammatory, anti-psychotic, anti-cancer, anti-Parkinson's, antidepressant, and anticoagulant applications. It also provides specialty chemicals for use in battery chemicals, personal care, agrochemicals, coatings, electronics, and industrial processes; photoresist chemicals to semiconductor applications; electrolyte additives for lithium battery cells; and parabens, methyl salicylate, and other commodity chemicals for cosmetics, agrochemicals, and fine chemicals. The company was formerly known as Ami Organics Limited and changed its name to Acutaas Chemicals Limited in May 2025. Acutaas Chemicals Limited was founded in 2004 and is based in Surat, India."
  },
  "DATAPATTNS.NS": {
    "name": "Data Patterns (India) Limited",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "description": "Data Patterns (India) Limited provides defense and aerospace electronics solutions in India. The company engages in the manufacturing of measuring, testing, navigating, and control equipment; and air and spacecraft and related machinery, as well as provides technical testing and analysisIt also offers COTS boards, ATE and test systems, RF and microwave products, electronic warfare products, cockpit and rugged displays, radar and radar subsystems, identify friend and Foe products, avionic systems, laser and electro optic systems, space systems, power supply products, naval systems, communication products, gimbal and actuator controller products, launch and fire control systems, high-speed processors, digital IF processors and waveform generators, consoles, and navigation systems; and software and application products. In addition, the company provides hardware design, product development, ATE/functional test equipment, FPGA, software, microwave, mechanical product design, manufacturing, and environmental qualification testing services. Data Patterns (India) Limited was incorporated in 1998 and is based in Chennai, India."
  },
  "CPPLUS.NS": {
    "name": "CPPLUS",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "description": "Aditya Infotech Limited manufactures, assembles and trades security and surveillance equipment in India and internationally. The company offers analog cameras, digital video recorders, internet protocol network cameras, network video recorders, biometric products, access control products, mobile surveillance solutions, body-worn cameras, temperature screening solutions, interactive displays, routers, cables, power supplies, and thermal cameras. It also provides temperature screening solutions, explosion-proof cameras, integrated central command and control software, AI/ deep learning-based video analytics solutions, access control, time-attendance solutions, biometric products, video doorbells and video door-phones, HMS, AMS, interactive displays, monitors, SD Cards, as well as other accessories and products including cabling, racks, storage solutions and customized solutions; and products for enterprise and consumer segments under the CP PLUS and Dahua brands. In addition, it offers AI-IoT-based centralized remote electronic surveillance services under the OnVigil brand for intruder detection and prevention, fire safety protection and prevention, AI-powered video monitoring, standard operating protocol monitoring, and health monitoring of surveillance systems, as well as attendance monitoring cloud-based solutions, and user interface and cloud software solutions. Further, it provides cloud storage services for surveillance management under CP PLUS Cloud Storage brand name; and software solutions, such as health monitoring systems, attendance management systems, and video management software. It offers its products to government establishments, retail chains, financial institutions, residential, industrial warehouse, public spaces, and infrastructure projects. The company was formerly known as Perfect Lucky Goldstar International Limited and changed its name to Aditya Infotech Limited in August 1997. The company was founded in 1994 and is based in Noida, India."
  },
  "ARVIND.NS": {
    "name": "Arvind Limited",
    "sector": "Consumer Cyclical",
    "industry": "Textile Manufacturing",
    "description": "Arvind Limited, together with its subsidiaries, manufactures, markets, retails, supplies, and exports textiles in India and internationally. It operates through Textiles, Advanced Material, and Others segments. The company offers denim fabrics, woven and knitted fabrics, and voiles and garments products. It also provides a range of specialized clothing and accessories for factory workers, fire-fighters, construction crew, soldiers, and healthcare and security personnel; hot-gas and liquid filtration products; automotive interiors and seating solutions; and composites and coated fabrics. In addition, the company offers water treatment, industrial waste water, and sewage treatment solutions for industries, as well as zero liquid discharge solutions. Further, it is involved in the e-commerce, agriculture produce, engineering, telecommunication, technical textiles, and other businesses, as well as provision of EPABX and one to many radio solutions; and building residential, commercial, and industrial spaces. Arvind Limited was founded in 1897 and is headquartered in Ahmedabad, India."
  },
  "ABBOTINDIA.NS": {
    "name": "Abbott India Limited",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "description": "Abbott India Limited, together with its subsidiaries, operates as a pharmaceutical company in India. The company offers pharmaceutical products for gastroenterology, women's health, metabolic, central nervous system, vaccines, and multispecialty, including insomnia, vitamin D deficiency, pre-term labor, and pain management. It also provides anti-infectives, cardio-diabeto, GI & hepato, hormones, neuro-psychiat, pain management, respiratory, hepatic, neuroscience, metabolics, gennext, and consumer care products. The company was formerly known as Knoll Pharmaceuticals Limited and changed its name to Abbott India Limited in July 2002. The company was founded in 1910 and is headquartered in Mumbai, India. Abbott India Limited operates as a subsidiary of Abbott Capital India Limited."
  },
  "TANFACIND.BO": {
    "name": "Tanfac Industries Limited",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "description": "Tanfac Industries Limited produces and sells fluorine chemicals in India. The company provides anhydrous and dilute hydrofluoric and sulphuric acid, oleum, aluminium and potassium fluoride, potassium bifluoride, boron trifluoride complexes, calcium sulphate, isobutyl acetophenone, acetic, peracetic acid, sodium silcofluoride, and poly aluminium chloride, etc. It also exports its products. Tanfac Industries Limited was incorporated in 1972 and is based in Chennai, India."
  },
  "AARTIIND.NS": {
    "name": "Aarti Industries Limited",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "description": "Aarti Industries Limited engages in the manufacture and sale of specialty chemicals in India and internationally. It offers di chloro benzene, nitro chloro and nitro benzene, nitro toluenes, sulphur, and other organic and inorganic products; chlorination, nitration, hydrogenation, ammonolysis, halex, dinitro chlorination, alkylation, hydrolysis, methoxylation, esterification, diazotization, sulphonation, condensation, n-alkylation, and oxidation. It also provides end use products, including dyes, basic pharma, pigments, agro chemicals, polymers, fertilizers, UV absorbers, plasticizers, specialty chemicals, flavour fragrance and food beverage products, and refinery and oil field chemicals, as well as intermediates. Aarti Industries Limited was incorporated in 1984 and is headquartered in Mumbai, India."
  },
  "JAYAGROGN.NS": {
    "name": "Jayant Agro-Organics Limited",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "description": "Jayant Agro-Organics Limited, an oleochemical company, engages in manufacturing and trading of castor oil and its derivatives in India and internationally. The company operates through three segments: Castor Oil, Derivatives, and Power Generation. It offers dehydrated, hydrogenated, and cold pressed castor oil; and ethoxylates, pragati, hydrogenated castor oil fatty acid, 2-octanol PAC, Jagroflow-13, Jagroflow-15, sebacic acid, dehydrated castor oil fatty acid, and 2-octanone, as well as pharma grade castor oil. The company also provides Jagrocos, Jagromul, Dermcare, Jagroil COCG series, Jagrolatum, Jagrowax CHS, Jagrosorb, and Jagrocid products. In addition, it engages in the power generation business. The company serves agriculture, cosmetics, electronics, lubricants, paints, perfumeries, pharmaceuticals, polymers and plastics, textiles, and rubber and construction industries. The company was incorporated in 1992 and is based in Mumbai, India. Jayant Agro-Organics Limited is a subsidiary of Jayant Finvest Limited."
  },
  "GANESHHOUC.NS": {
    "name": "Ganesh Housing Limited",
    "sector": "Real Estate",
    "industry": "Real Estate - Development",
    "description": "Ganesh Housing Limited engages in the real estate and construction businesses in India. It is involved in the construction of residential and commercial projects; and infrastructure projects. The company was founded in 1965 and is based in Ahmedabad, India."
  },
  "MCX.NS": {
    "name": "Multi Commodity Exchange of India Limited",
    "sector": "Financial Services",
    "industry": "Financial Data & Stock Exchanges",
    "description": "Multi Commodity Exchange of India Limited, a commodity derivatives exchange, provides a platform to facilitate online trading of commodity derivatives in India. It offers iCOMDEX, a real-time commodity futures price indices; and trades in bullion, base metals, energy, and agricultural commodities. The company also provides clearing and settlement services; and data feed subscription and membership services. It has strategic alliances, consultancy, and collaboration agreements with various exchanges, such as CME Group, Dalian Commodity Exchange, London Metal Exchange, European Energy Exchange AG, Taiwan Futures Exchange, and Zhengzhou Commodity Exchange, Jakarta Futures Exchange, and Chittagong Stock Exchange Limited. The company was incorporated in 2002 and is based in Mumbai, India."
  },
  "UNOMINDA.NS": {
    "name": "Uno Minda Limited",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "description": "Uno Minda Limited, together with its subsidiaries, manufactures and supplies auto components and systems in India and internationally. It provides alloy wheels, automotive switches, horns, infotainment systems, speakers, socket assemblies, fuel hoses, sensors, actuators, controllers, telematics and connected solutions, alternate fuel systems, air filtration systems, canisters, seat head rest and arm rests, luggage boards, automotive wireless chargers, seat recliner mechanism, multi mode drive switches, USB chargers, wheel covers, seat belts, shifters, cameras, air ducts and washer bottles, EA pads, spoilers, steering wheels with air bags, body sealings, fuel caps, and brake hoses. The company also offers automotive seats, switches and lights, heated grips, customized switches, die casting components, batteries, handle bar assemblies, combined braking systems, relays, and noise supressor caps; off board chargers, and battery management products; combination switches, lamps, traction motors, motor controllers, and intelligent transport systems; and lever combinations, DC converters, smart plugs, and FNR switches. It provides its products for 4 wheelers, 2/3 wheelers, 2 and 3 wheeler EVs, off road, and commercial vehicles. The company sells its products to original equipment manufacturers. The company was formerly known as Minda Industries Limited and changed its name to Uno Minda Limited in July 2022. The company was founded in 1958 and is headquartered in Gurugram, India."
  },
  "CHOLAFIN.NS": {
    "name": "Cholamandalam Investment and Finance Company Limited",
    "sector": "Financial Services",
    "industry": "Credit Services",
    "description": "Cholamandalam Investment and Finance Company Limited, operates as a non-banking finance company in India. The company operates through Vehicle Finance, Loan Against Property, Home Loans, and Other Loans segments. It offers loans for commercial vehicles, passenger vehicles, two- and three- wheelers, and tractors, as well as construction equipment. The company also provides secured loans against property, and home and SME loans, as well as consumer and small enterprise loans, including personal loans, professional loans, and business loans to salaried, self-employed professional and non-professional customers, and micro and small businesses. In addition, it offers gold loans, consumer durable loans, corporate insurance agencies, stockbroking and depository participants, offline payment aggregator, home extension, balance transfer of existing loans, supply chain finance, and secured term loans. Further, the company provides dealer portal services under the Gaadi Bazaar brand, which act as a hub for dealers in listing vehicles, generating leads, and applying for loans and trade advances. Additionally, it operates Payswiff, an omnichannel payment transaction solution that lets business owners accept payments from their customers in-store, at-home deliveries, online and on-the-go using mPOS, and POS solutions. The company was incorporated in 1978 and is headquartered in Chennai, India."
  },
  "KAJARIACER.NS": {
    "name": "Kajaria Ceramics Limited",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "description": "Kajaria Ceramics Limited manufactures, sells, and distributes ceramic and vitrified wall and floor tiles under the Kajaria, GresBond, and Eternity brands in India and internationally. The company operates through Tiles and Others segments. It offers ceramic wall and floor tiles, polished vitrified tiles, glazed vitrified tiles, grestough floor tiles, tile adhesives, epoxy and unsanded grout, and tile cleaners. The company also manufactures and sells sanitary ware and faucets; and trades plywood and laminates. It serves homeowners, architects, interior designers, developers, contractors, and other sectors. Kajaria Ceramics Limited was incorporated in 1985 and is headquartered in New Delhi, India."
  },
  "NATCOPHARM.NS": {
    "name": "NATCO Pharma Limited",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "description": "NATCO Pharma Limited, a pharmaceutical company, engages in the research and development, manufacturing, and marketing of finished dosage formulations, active pharmaceutical ingredients (APIs), and intermediates in India, the United States, and internationally. The company offers formulations in various therapeutic areas, including cancers of blood, liver, kidney, lung, brain, breast, and ovary; and APIs in various categories, such as oncology, central nervous system, pain management, and cardiovascular care. It also provides orthopedic products comprising bisphosphonates, which are oral and injectable drugs; and gastroenterology products consisting of novel drugs for chronic hepatitis-B and hepatitis-C, as well as contract manufacturing services. In addition, the company offers neurology, cardiology and diabetology products for the treatment of hypertension, stable angina, and CHF. Further, the company provides agro chemicals and biological pest management solutions for management of insects, diseases, and weeds across a range of crops. NATCO Pharma Limited was incorporated in 1981 and is headquartered in Hyderabad, India."
  },
  "ANANDRATHI.NS": {
    "name": "Anand Rathi Wealth Limited",
    "sector": "Financial Services",
    "industry": "Asset Management",
    "description": "Anand Rathi Wealth Limited provides financial advisory, brokerage, and consultancy services in India. The company offers wealth solutions, including investment planning and risk management solutions. It also operates Omni Financial Advisor, a technology platform for mutual fund distributors and independent financial advisors, which include client reporting, business dashboard, client engagement, online mutual fund transactions, and goal planning products. It serves high net-worth individuals and ultra-high net-worth individuals. The company was formerly known as Anand Rathi Wealth Services Limited and changed its name to Anand Rathi Wealth Limited in January 2021. Anand Rathi Wealth Limited was founded in 1994 and is based in Mumbai, India."
  },
  "POLYCAB.NS": {
    "name": "Polycab India Limited",
    "sector": "Industrials",
    "industry": "Electrical Equipment & Parts",
    "description": "Polycab India Limited manufactures and sells wires and cables under the POLYCAB brand in India and internationally. The company operates through three segments: Wires and Cables; Fast Moving Electrical Goods (FMEG); and Engineering, Procurement and Construction (EPC). The Wires and Cables segment provides wires, such as PolycabSuprema house wires, PolycabMaxima+ Green wire, PolycabPrimma house wires, ETIRA house wires, PolycabOptima+, GREENWIRE 180m, and POLYCAB LF FR 180m; and cables, such as control, rubber, defense, special, fire protection, marine offshore/onshore, domestic appliance and lighting, aerial bunched, industrial, high temperature, LV power, MV power, EHV power, communication and data, and instrumentation. The Fast Moving Electrical Goods segment offers ceiling, table, pedestal, wall, exhaust, farrata, and air circulated fans; LED lighting and luminaires, such as LED Bulb, downlight, panel light, led batten, outdoor lights, and rope and strip lights; water heaters; switches and accessories; switchgears consisting of isolators, MCB, RCCB, RCBO, distribution board, ACCL, and MCB changeover switches; solar products, including solar panel and invertors; and pumps, conduits, and domestic appliances. The EPC segment designs, engineers, and supplies materials; and engages in the survey, execution, and commissioning of turn-key power distribution, transmission, and rural electrification projects. The company provides coolers and iron appliances. It operates a distribution network through authorized dealers and distributors, and retail outlets. The company was founded in 1964 and is based in Mumbai, India."
  }
}